[M_TreeHugger MissionDefinition]
MissionDescription="A treant named Aubrey has asked you for help. A gang of orcs have set up a lumber camp within [place]The Forest of Being Eaten Alive By Trees[-place]. If you can plant and protect a treant sapling until it grows to maturity and destroys the camp, you'll have Aubrey's (sarcastic, halfhearted) thanks."

[M_TreeHugger:DefendSapling MissionObjectiveDefinition]
ProgressMessage="Defend sapling"

[M_TreeHugger:DestroyHuts MissionObjectiveDefinition]
ProgressMessage="Escort Mosstache to huts"

[M_TreeHugger:GoToLumberCamp MissionObjectiveDefinition]
ProgressMessage="Go to lumber camp"

[M_TreeHugger:PlantSapling MissionObjectiveDefinition]
ProgressMessage="Plant sapling"
